Тест_ЗУП_31_КОРП/src/Catalogs/Чатботы/Чатботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Чатботы</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацииИнформационнойБазыВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЧатботов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияОбновлений</name>
    <type>
      <types>EnumRef.СпособыПолученияОбновленийЧатботов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПриветствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьВозраст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОписаниеКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаВозраста</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьИмя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаИмени</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьНомерТелефона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаНомераТелефона</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьАдресЭлектроннойПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаАдресаЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьИнформациюОСебе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаИнформацииОСебе</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьФайлРезюме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаФайлаРезюме</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/СпособыПолученияОбновленийЧатботов/СпособыПолученияОбновленийЧатботов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПолученияОбновленийЧатботов</name>
  <enumValues>
    <name>LongPolling</name>
  </enumValues>
  <enumValues>
    <name>Webhook</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/Чатботы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособПолученияОбновлений <> Перечисления.СпособыПолученияОбновленийЧатботов.Webhook Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "АдресПубликацииИнформационнойБазыВИнтернете");
	КонецЕсли;
	
	Если Не ВыводитьОписаниеКомпании Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ОписаниеКомпании");
	КонецЕсли;
	
	Если Не ЗапрашиватьИмя Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТекстЗапросаИмени");
	КонецЕсли;
	
	Если Не ЗапрашиватьВозраст Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТекстЗапросаВозраста");
	КонецЕсли;
	
	Если Не ЗапрашиватьНомерТелефона Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТекстЗапросаНомераТелефона");
	КонецЕсли;
	
	Если Не ЗапрашиватьАдресЭлектроннойПочты Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТекстЗапросаАдресаЭлектроннойПочты");
	КонецЕсли;
	
	Если Не ЗапрашиватьИнформациюОСебе Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТекстЗапросаИнформацииОСебе");
	КонецЕсли;
	
	Если Не ЗапрашиватьФайлРезюме Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТекстЗапросаФайлаРезюме");
	КонецЕсли;
	
	Если Не ЗапрашиватьНомерТелефона И Не ЗапрашиватьАдресЭлектроннойПочты Тогда
		ТекстСообщения = НСтр("ru = 'Для регистрации отклика нужно запрашивать хотя бы один вид контактной информации: адрес электронной почты или телефон.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПрежниеЗначенияРеквизитов();
	СоздатьРегламентноеЗадание();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ОбновитьWebhook(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьРегламентноеЗадание();
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПрежниеЗначенияРеквизитов()
	
	ИменаРеквизитов = 
		"Используется,
		|СпособПолученияОбновлений, 
		|АдресПубликацииИнформационнойБазыВИнтернете";
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ПрежниеЗначения", Новый Структура(ИменаРеквизитов));
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, ИменаРеквизитов);
	ДополнительныеСвойства.Вставить("ПрежниеЗначения", ЗначенияРеквизитов);
	
КонецПроцедуры

Процедура ОбновитьWebhook(Отказ)
	
	ПрежниеЗначения = ДополнительныеСвойства.ПрежниеЗначения;
	
	WebhookИспользуется = Ложь;
	Если Используется Тогда
		Если СпособПолученияОбновлений = Перечисления.СпособыПолученияОбновленийЧатботов.Webhook Тогда
			WebhookИспользуется = Истина;
		КонецЕсли;
	КонецЕсли;
	
	БылоWebhookИспользуется = Ложь;
	Если ПрежниеЗначения.Используется = Истина Тогда
		Если ПрежниеЗначения.СпособПолученияОбновлений = Перечисления.СпособыПолученияОбновленийЧатботов.Webhook Тогда
			БылоWebhookИспользуется = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если WebhookИспользуется И Не БылоWebhookИспользуется Тогда
		УстановитьWebhook(Отказ);
	КонецЕсли;
	
	Если Не WebhookИспользуется И БылоWebhookИспользуется Тогда
		УдалитьWebhook(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьWebhook(Отказ)
	
	Ответ = ЧатботыСлужебный.УстановитьWebhook(Ссылка);
	
	Если Ответ.Результат = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось установить webhook.
              |Подробнее: 
              |%1.'"), 
		Ответ.ОписаниеОшибки);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	
КонецПроцедуры

Процедура УдалитьWebhook(Отказ)
	
	Ответ = ЧатботыСлужебный.УдалитьWebhook(Ссылка);
	
	Если Ответ.Результат = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось удалить webhook.
              |Подробнее: 
              |%1.'"), 
		Ответ.ОписаниеОшибки);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	
КонецПроцедуры

Процедура СоздатьРегламентноеЗадание()
	
	Задание = ЧатботыСлужебный.ЗаданиеПолученияСообщенийЧатботу(РегламентноеЗаданиеGUID);
	
	LongPollingИспользуется = Ложь;
	Если Используется Тогда
		Если СпособПолученияОбновлений = Перечисления.СпособыПолученияОбновленийЧатботов.LongPolling Тогда
			LongPollingИспользуется = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не LongPollingИспользуется Тогда
		Если Задание <> Неопределено Тогда
			РегламентныеЗаданияСервер.УдалитьЗадание(РегламентноеЗаданиеGUID);
			РегламентноеЗаданиеGUID = Неопределено;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Задание <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("РегламентноеЗадание", Задание);
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ПолучениеСообщенийЧатбота);
	ПараметрыЗадания.Вставить("Использование", Ложь);
	Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	РегламентноеЗаданиеGUID = РегламентныеЗаданияСервер.УникальныйИдентификатор(Задание);
	ДополнительныеСвойства.Вставить("РегламентноеЗадание", Задание);
	
КонецПроцедуры

Процедура ЗапуститьРегламентноеЗадание()
	
	Задание = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("РегламентноеЗадание", Задание) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	Изменения = Новый Структура;
	Изменения.Вставить("Использование", Истина);
	Изменения.Вставить("Расписание", РасписаниеРегламентногоЗадания());
	Изменения.Вставить("Наименование", Лев(ПредставлениеРегламентногоЗадания(), 120));
	
	ПараметрыПроцедуры = Новый Массив;
	ПараметрыПроцедуры.Добавить(Ссылка);
	
	Изменения.Вставить("Параметры", ПараметрыПроцедуры);
	
	РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, Изменения);
	
КонецПроцедуры

Функция РасписаниеРегламентногоЗадания()
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодПовтораВТечениеДня = 3;
	
	Возврат Расписание;
	
КонецФункции

Функция ПредставлениеРегламентногоЗадания()
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Получение сообщений чатбота «%1»'"), Наименование);
КонецФункции

#КонецОбласти

#КонецЕсли
